app/controllers/api/elements_controller.rb

SELECT "elements"."url" FROM "elements" GROUP BY "elements"."url"
---
  def page_urls
    urls = Element.select(:url).group(:url)