app/controllers/api/scrapers_controller.rb

INSERT INTO "elements" ("url", "elemtype", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def scrape

    @current_page.contents.each do |content|
      @element = Element.new
      @element.url = @current_page.url
      @element.elemtype = "content"
      @element.content = content
      @element.save